app/controllers/adscripcions_controller.rb

SELECT * FROM `adscripcions`
---
  def index
    @adscripcions = Adscripcion.all.paginate(:page => params[:page], :per_page => 25)

SELECT * FROM `adscripcions` WHERE (`adscripcions`.`id` = 1)
---
  def show
    @adscripcion = Adscripcion.find(params[:id])

SELECT * FROM `adscripcions` WHERE (`adscripcions`.`id` = 1)
DELETE FROM `adscripcions` WHERE `id` = 1
---
  def destroy
    @adscripcion = Adscripcion.find(params[:id])
    unless @adscripcion.users.empty?
      @adscripcion.destroy