app/controllers/personas_controller.rb

  def show
    @persona = Persona.find(params[:id])
---
SELECT * FROM `personas` WHERE (`personas`.`id` = 1)

  def edit
    @persona = Persona.find(params[:id])
---
SELECT * FROM `personas` WHERE (`personas`.`id` = 2)

  def create
    @persona = Persona.new(params[:persona])

    respond_to do |format|
      if @persona.save
---
INSERT INTO `personas` (`enlace`, `telefono_trabajo`, `direccion_trabajo`, `updated_at`, `telefono_casa`, `telefono_alternativo`, `paterno`, `curp`, `telefono_celular`, `email`, `fecha_nacimiento`, `materno`, `nombre`, `direccion_casa`, `created_at`, `rfc`) VALUES('333', '', '', '2015-10-09 18:03:29', '', NULL, 'monterrosa', '', '', '', '2015-10-09', 'lopez', 'CARLOS', '', '2015-10-09 18:03:29', '')