app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 3)
INSERT INTO `users` (`login`, `persona_id`, `activated_at`, `name`, `email`, `created_at`, `activation_code`, `crypted_password`, `updated_at`, `remember_token`, `salt`, `remember_token_expires_at`) VALUES('cmonterrosa', 'd688bc07-edb2-419c-a32f-bff569dbd3ab', '2015-10-14 19:32:43', 'CARLOS AUGUSTO MONTERROSA LOPEZ', 'cmonterrosa@gmail.com', '2015-10-14 19:32:43', '8ac657833af2228013cfc1a9e18e9e33852149a3', '54f6e68d0c3c17ae8cbf2d9998d11ec44bd28284', '2015-10-14 19:32:43', NULL, '05ca12e0c71a109d0a9d37cf21813e2210692c8b', NULL)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.persona = (params[:persona] && params[:persona][:per_curp]) ? Persona.find(:first, :conditions => ["per_curp =  ?", params[:persona][:per_curp]]) : nil
    @user.persona ||= Persona.new(params[:persona])
    @user.activo = (params[:user] && params[:user][:activo] == 'SI') ? true : false
    success = @user && @user.save